expenses_tracker_backend/app/models/user.rb

  def self.grouped_expenses(user_id)
    user = User.where(id: user_id)[0]
    user_expenses = user.expenses
    grouped_categories = []
    uniq_categories = user_expenses.map { |expense| expense[:category_id] }.uniq

    uniq_categories.each do |category|
      user_expenses.each do |expense|
        if expense[:category_id] == category
          found = false
          grouped_categories.each do |grouped_category|
            if grouped_category[:category_id] == category
              found = true
              grouped_category[:amount] += expense[:amount]
            end
          end
          if !found
            category_name = Category.find_by(id: category)[:name]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ?  [["id", 5]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = ?  [["user_id", 5]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]