expenses_tracker_backend/app/controllers/users_controller.rb

  def expenses_by_categories
    grouped_expenses = User.grouped_expenses(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."user_id" = ?  [["user_id", "5"]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = ? LIMIT ?  [["user_id", 5], ["LIMIT", 1]]